sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_irda.c
    hirda->gState = HAL_IRDA_STATE_BUSY;

    /* Disable the IRDA peripheral */
    __HAL_IRDA_DISABLE(hirda);

    /* Set the IRDA communication parameters */
    IRDA_SetConfig(hirda);

    /* In IrDA mode, the following bits must be kept cleared:
    - LINEN, STOP and CLKEN bits in the USART_CR2 register,
    - SCEN and HDSEL bits in the USART_CR3 register.*/
    CLEAR_BIT(hirda->Instance->CR2, (USART_CR2_LINEN | USART_CR2_STOP | USART_CR2_CLKEN));
    CLEAR_BIT(hirda->Instance->CR3, (USART_CR3_SCEN | USART_CR3_HDSEL));

    /* Enable the IRDA peripheral */
    __HAL_IRDA_ENABLE(hirda);

    /* Set the prescaler */
    MODIFY_REG(hirda->Instance->GTPR, USART_GTPR_PSC, hirda->Init.Prescaler);

    /* Configure the IrDA mode */
    MODIFY_REG(hirda->Instance->CR3, USART_CR3_IRLP, hirda->Init.IrDAMode);

    /* Enable the IrDA mode by setting the IREN bit in the CR3 register */
    SET_BIT(hirda->Instance->CR3, USART_CR3_IREN);

    /* Initialize the IRDA state*/
    hirda->ErrorCode = HAL_IRDA_ERROR_NONE;
    hirda->gState = HAL_IRDA_STATE_READY;
    hirda->RxState = HAL_IRDA_STATE_READY;

    return HAL_OK;
}

/**
  * @brief  DeInitializes the IRDA peripheral
  * @param  hirda  Pointer to a IRDA_HandleTypeDef structure that contains
  *                the configuration information for the specified IRDA module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_IRDA_DeInit(IRDA_HandleTypeDef *hirda)
{
    /* Check the IRDA handle allocation */
    if (hirda == NULL)
    {
        return HAL_ERROR;
    }

    /* Check the parameters */
    assert_param(IS_IRDA_INSTANCE(hirda->Instance));

    hirda->gState = HAL_IRDA_STATE_BUSY;

    /* Disable the Peripheral */
    __HAL_IRDA_DISABLE(hirda);

    /* DeInit the low level hardware */
#if USE_HAL_IRDA_REGISTER_CALLBACKS == 1
    if (hirda->MspDeInitCallback == NULL)
    {
        hirda->MspDeInitCallback = HAL_IRDA_MspDeInit;
    }
    /* DeInit the low level hardware */
    hirda->MspDeInitCallback(hirda);
#else
    HAL_IRDA_MspDeInit(hirda);
#endif /* USE_HAL_IRDA_REGISTER_CALLBACKS */

    hirda->ErrorCode = HAL_IRDA_ERROR_NONE;

    hirda->gState = HAL_IRDA_STATE_RESET;
    hirda->RxState = HAL_IRDA_STATE_RESET;

    /* Release Lock */
    __HAL_UNLOCK(hirda);

    return HAL_OK;
}

/**
  * @brief  IRDA MSP Init.
  * @param  hirda  Pointer to a IRDA_HandleTypeDef structure that contains
  *                the configuration information for the specified IRDA module.
  * @retval None
  */
__weak void HAL_IRDA_MspInit(IRDA_HandleTypeDef *hirda)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hirda);

    /* NOTE: This function should not be modified, when the callback is needed,
             the HAL_IRDA_MspInit can be implemented in the user file
     */
}

/**
  * @brief  IRDA MSP DeInit.
  * @param  hirda  Pointer to a IRDA_HandleTypeDef structure that contains
  *                the configuration information for the specified IRDA module.
  * @retval None
  */
__weak void HAL_IRDA_MspDeInit(IRDA_HandleTypeDef *hirda)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hirda);

    /* NOTE: This function should not be modified, when the callback is needed,
             the HAL_IRDA_MspDeInit can be implemented in the user file
     */
}

#if (USE_HAL_IRDA_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a User IRDA Callback
  *         To be used instead of the weak predefined callback
  * @param  hirda irda handle
  * @param  CallbackID ID of the callback to be registered
  *         This parameter can be one of the following values:
  *           @arg @ref HAL_IRDA_TX_HALFCOMPLETE_CB_ID Tx Half Complete Callback ID
  *           @arg @ref HAL_IRDA_TX_COMPLETE_CB_ID Tx Complete Callback ID
  *           @arg @ref HAL_IRDA_RX_HALFCOMPLETE_CB_ID Rx Half Complete Callback ID
  *           @arg @ref HAL_IRDA_RX_COMPLETE_CB_ID Rx Complete Callback ID
  *           @arg @ref HAL_IRDA_ERROR_CB_ID Error Callback ID
  *           @arg @ref HAL_IRDA_ABORT_COMPLETE_CB_ID Abort Complete Callback ID
  *           @arg @ref HAL_IRDA_ABORT_TRANSMIT_COMPLETE_CB_ID Abort Transmit Complete Callback ID
  *           @arg @ref HAL_IRDA_ABORT_RECEIVE_COMPLETE_CB_ID Abort Receive Complete Callback ID
  *           @arg @ref HAL_IRDA_MSPINIT_CB_ID MspInit Callback ID
  *           @arg @ref HAL_IRDA_MSPDEINIT_CB_ID MspDeInit Callback ID
  * @param  pCallback pointer to the Callback function
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_IRDA_RegisterCallback(IRDA_HandleTypeDef *hirda, HAL_IRDA_CallbackIDTypeDef CallbackID, pIRDA_CallbackTypeDef pCallback)
{
    HAL_StatusTypeDef status = HAL_OK;

    if (pCallback == NULL)
    {
        /* Update the error code */
        hirda->ErrorCode |= HAL_IRDA_ERROR_INVALID_CALLBACK;

        return HAL_ERROR;
    }
    /* Process locked */
    __HAL_LOCK(hirda);

    if (hirda->gState == HAL_IRDA_STATE_READY)
    {
        switch (CallbackID)
        {
        case HAL_IRDA_TX_HALFCOMPLETE_CB_ID :
            hirda->TxHalfCpltCallback = pCallback;
            break;

        case HAL_IRDA_TX_COMPLETE_CB_ID :
            hirda->TxCpltCallback = pCallback;
            break;

        case HAL_IRDA_RX_HALFCOMPLETE_CB_ID :
            hirda->RxHalfCpltCallback = pCallback;
            break;

        case HAL_IRDA_RX_COMPLETE_CB_ID :
            hirda->RxCpltCallback = pCallback;
            break;

        case HAL_IRDA_ERROR_CB_ID :
            hirda->ErrorCallback = pCallback;
            break;

        case HAL_IRDA_ABORT_COMPLETE_CB_ID :
            hirda->AbortCpltCallback = pCallback;
            break;

        case HAL_IRDA_ABORT_TRANSMIT_COMPLETE_CB_ID :
            hirda->AbortTransmitCpltCallback = pCallback;
            break;

        case HAL_IRDA_ABORT_RECEIVE_COMPLETE_CB_ID :
            hirda->AbortReceiveCpltCallback = pCallback;
            break;

        case HAL_IRDA_MSPINIT_CB_ID :
            hirda->MspInitCallback = pCallback;
            break;

        case HAL_IRDA_MSPDEINIT_CB_ID :
            hirda->MspDeInitCallback = pCallback;
            break;

        default :
            /* Update the error code */
            hirda->ErrorCode |= HAL_IRDA_ERROR_INVALID_CALLBACK;

            /* Return error status */
            status =  HAL_ERROR;
            break;
        }
    }
    else if (hirda->gState == HAL_IRDA_STATE_RESET)
    {
        switch (CallbackID)
        {
        case HAL_IRDA_MSPINIT_CB_ID :
            hirda->MspInitCallback = pCallback;
            break;

        case HAL_IRDA_MSPDEINIT_CB_ID :
            hirda->MspDeInitCallback = pCallback;
            break;

        default :
            /* Update the error code */
            hirda->ErrorCode |= HAL_IRDA_ERROR_INVALID_CALLBACK;

            /* Return error status */
            status =  HAL_ERROR;
            break;
        }
    }
    else
    {
        /* Update the error code */
        hirda->ErrorCode |= HAL_IRDA_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  HAL_ERROR;
    }

    /* Release Lock */
    __HAL_UNLOCK(hirda);

