sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_irda.c
        hirda->pTxBuffPtr = pData;
        hirda->TxXferSize = Size;
        hirda->TxXferCount = Size;

        hirda->ErrorCode = HAL_IRDA_ERROR_NONE;
        hirda->gState = HAL_IRDA_STATE_BUSY_TX;

        /* Process Unlocked */
        __HAL_UNLOCK(hirda);

        /* Enable the IRDA Transmit Data Register Empty Interrupt */
        SET_BIT(hirda->Instance->CR1, USART_CR1_TXEIE);

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief Receive an amount of data in non blocking mode.
  * @note  When UART parity is not enabled (PCE = 0), and Word Length is configured to 9 bits (M1-M0 = 01),
  *        the received data is handled as a set of u16. In this case, Size must reflect the number
  *        of u16 available through pData.
  * @param hirda Pointer to a IRDA_HandleTypeDef structure that contains
  *              the configuration information for the specified IRDA module.
  * @param pData Pointer to data buffer (u8 or u16 data elements).
  * @param Size  Amount of data elements (u8 or u16) to be received.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_IRDA_Receive_IT(IRDA_HandleTypeDef *hirda, uint8_t *pData, uint16_t Size)
{
    /* Check that a Rx process is not already ongoing */
    if (hirda->RxState == HAL_IRDA_STATE_READY)
    {
        if ((pData == NULL) || (Size == 0U))
        {
            return HAL_ERROR;
        }

        /* Process Locked */
        __HAL_LOCK(hirda);

        hirda->pRxBuffPtr = pData;
        hirda->RxXferSize = Size;
        hirda->RxXferCount = Size;

        hirda->ErrorCode = HAL_IRDA_ERROR_NONE;
        hirda->RxState = HAL_IRDA_STATE_BUSY_RX;

        /* Process Unlocked */
        __HAL_UNLOCK(hirda);

        /* Enable the IRDA Parity Error and Data Register Not Empty Interrupts */
        SET_BIT(hirda->Instance->CR1, USART_CR1_PEIE | USART_CR1_RXNEIE);

        /* Enable the IRDA Error Interrupt: (Frame error, Noise error, Overrun error) */
        SET_BIT(hirda->Instance->CR3, USART_CR3_EIE);

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief Send an amount of data in DMA mode.
  * @note  When UART parity is not enabled (PCE = 0), and Word Length is configured to 9 bits (M1-M0 = 01),
  *        the sent data is handled as a set of u16. In this case, Size must reflect the number
  *        of u16 available through pData.
  * @param hirda Pointer to a IRDA_HandleTypeDef structure that contains
  *              the configuration information for the specified IRDA module.
  * @param pData Pointer to data buffer (u8 or u16 data elements).
  * @param Size  Amount of data elements (u8 or u16) to be sent.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_IRDA_Transmit_DMA(IRDA_HandleTypeDef *hirda, uint8_t *pData, uint16_t Size)
{
    uint32_t *tmp;

    /* Check that a Tx process is not already ongoing */
    if (hirda->gState == HAL_IRDA_STATE_READY)
    {
        if ((pData == NULL) || (Size == 0U))
        {
            return HAL_ERROR;
        }

        /* Process Locked */
        __HAL_LOCK(hirda);

        hirda->pTxBuffPtr = pData;
        hirda->TxXferSize = Size;
        hirda->TxXferCount = Size;

        hirda->ErrorCode = HAL_IRDA_ERROR_NONE;
        hirda->gState = HAL_IRDA_STATE_BUSY_TX;

        /* Set the IRDA DMA transfer complete callback */
        hirda->hdmatx->XferCpltCallback = IRDA_DMATransmitCplt;

        /* Set the IRDA DMA half transfer complete callback */
        hirda->hdmatx->XferHalfCpltCallback = IRDA_DMATransmitHalfCplt;

        /* Set the DMA error callback */
        hirda->hdmatx->XferErrorCallback = IRDA_DMAError;

        /* Set the DMA abort callback */
        hirda->hdmatx->XferAbortCallback = NULL;

        /* Enable the IRDA transmit DMA channel */
        tmp = (uint32_t *)&pData;
        HAL_DMA_Start_IT(hirda->hdmatx, *(uint32_t *)tmp, (uint32_t)&hirda->Instance->DR, Size);

        /* Clear the TC flag in the SR register by writing 0 to it */
        __HAL_IRDA_CLEAR_FLAG(hirda, IRDA_FLAG_TC);

        /* Process Unlocked */
        __HAL_UNLOCK(hirda);

        /* Enable the DMA transfer for transmit request by setting the DMAT bit
        in the USART CR3 register */
        SET_BIT(hirda->Instance->CR3, USART_CR3_DMAT);

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief Receives an amount of data in DMA mode.
  * @note  When UART parity is not enabled (PCE = 0), and Word Length is configured to 9 bits (M1-M0 = 01),
  *        the received data is handled as a set of u16. In this case, Size must reflect the number
  *        of u16 available through pData.
  * @param hirda Pointer to a IRDA_HandleTypeDef structure that contains
  *              the configuration information for the specified IRDA module.
  * @param pData Pointer to data buffer (u8 or u16 data elements).
  * @param Size  Amount of data elements (u8 or u16) to be received.
  * @note   When the IRDA parity is enabled (PCE = 1) the data received contain the parity bit.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_IRDA_Receive_DMA(IRDA_HandleTypeDef *hirda, uint8_t *pData, uint16_t Size)
{
    uint32_t *tmp;

    /* Check that a Rx process is not already ongoing */
    if (hirda->RxState == HAL_IRDA_STATE_READY)
    {
        if ((pData == NULL) || (Size == 0U))
        {
            return HAL_ERROR;
        }

        /* Process Locked */
        __HAL_LOCK(hirda);

        hirda->pRxBuffPtr = pData;
        hirda->RxXferSize = Size;

        hirda->ErrorCode = HAL_IRDA_ERROR_NONE;
        hirda->RxState = HAL_IRDA_STATE_BUSY_RX;

        /* Set the IRDA DMA transfer complete callback */
        hirda->hdmarx->XferCpltCallback = IRDA_DMAReceiveCplt;

        /* Set the IRDA DMA half transfer complete callback */
        hirda->hdmarx->XferHalfCpltCallback = IRDA_DMAReceiveHalfCplt;

        /* Set the DMA error callback */
        hirda->hdmarx->XferErrorCallback = IRDA_DMAError;

        /* Set the DMA abort callback */
        hirda->hdmarx->XferAbortCallback = NULL;

        /* Enable the DMA channel */
        tmp = (uint32_t *)&pData;
        HAL_DMA_Start_IT(hirda->hdmarx, (uint32_t)&hirda->Instance->DR, *(uint32_t *)tmp, Size);

        /* Clear the Overrun flag just before enabling the DMA Rx request: can be mandatory for the second transfer */
        __HAL_IRDA_CLEAR_OREFLAG(hirda);

        /* Process Unlocked */
        __HAL_UNLOCK(hirda);

