sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_irda.c
        /* Enable the IRDA Parity Error Interrupt */
        SET_BIT(hirda->Instance->CR1, USART_CR1_PEIE);

        /* Enable the IRDA Error Interrupt: (Frame error, Noise error, Overrun error) */
        SET_BIT(hirda->Instance->CR3, USART_CR3_EIE);

        /* Enable the DMA transfer for the receiver request by setting the DMAR bit
        in the USART CR3 register */
        SET_BIT(hirda->Instance->CR3, USART_CR3_DMAR);

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief Pauses the DMA Transfer.
  * @param  hirda  Pointer to a IRDA_HandleTypeDef structure that contains
  *                the configuration information for the specified IRDA module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_IRDA_DMAPause(IRDA_HandleTypeDef *hirda)
{
    uint32_t dmarequest = 0x00U;

    /* Process Locked */
    __HAL_LOCK(hirda);

    dmarequest = HAL_IS_BIT_SET(hirda->Instance->CR3, USART_CR3_DMAT);
    if ((hirda->gState == HAL_IRDA_STATE_BUSY_TX) && dmarequest)
    {
        /* Disable the IRDA DMA Tx request */
        CLEAR_BIT(hirda->Instance->CR3, USART_CR3_DMAT);
    }

    dmarequest = HAL_IS_BIT_SET(hirda->Instance->CR3, USART_CR3_DMAR);
    if ((hirda->RxState == HAL_IRDA_STATE_BUSY_RX) && dmarequest)
    {
        /* Disable PE and ERR (Frame error, noise error, overrun error) interrupts */
        CLEAR_BIT(hirda->Instance->CR1, USART_CR1_PEIE);
        CLEAR_BIT(hirda->Instance->CR3, USART_CR3_EIE);

        /* Disable the IRDA DMA Rx request */
        CLEAR_BIT(hirda->Instance->CR3, USART_CR3_DMAR);
    }

    /* Process Unlocked */
    __HAL_UNLOCK(hirda);

    return HAL_OK;
}

/**
  * @brief Resumes the DMA Transfer.
  * @param  hirda  Pointer to a IRDA_HandleTypeDef structure that contains
  *                the configuration information for the specified IRDA module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_IRDA_DMAResume(IRDA_HandleTypeDef *hirda)
{
    /* Process Locked */
    __HAL_LOCK(hirda);

    if (hirda->gState == HAL_IRDA_STATE_BUSY_TX)
    {
        /* Enable the IRDA DMA Tx request */
        SET_BIT(hirda->Instance->CR3, USART_CR3_DMAT);
    }

    if (hirda->RxState == HAL_IRDA_STATE_BUSY_RX)
    {
        /* Clear the Overrun flag before resuming the Rx transfer */
        __HAL_IRDA_CLEAR_OREFLAG(hirda);

        /* Reenable PE and ERR (Frame error, noise error, overrun error) interrupts */
        SET_BIT(hirda->Instance->CR1, USART_CR1_PEIE);
        SET_BIT(hirda->Instance->CR3, USART_CR3_EIE);

        /* Enable the IRDA DMA Rx request */
        SET_BIT(hirda->Instance->CR3, USART_CR3_DMAR);
    }

    /* Process Unlocked */
    __HAL_UNLOCK(hirda);

    return HAL_OK;
}

/**
  * @brief Stops the DMA Transfer.
  * @param  hirda  Pointer to a IRDA_HandleTypeDef structure that contains
  *                the configuration information for the specified IRDA module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_IRDA_DMAStop(IRDA_HandleTypeDef *hirda)
{
    uint32_t dmarequest = 0x00U;
    /* The Lock is not implemented on this API to allow the user application
       to call the HAL IRDA API under callbacks HAL_IRDA_TxCpltCallback() / HAL_IRDA_RxCpltCallback():
       when calling HAL_DMA_Abort() API the DMA TX/RX Transfer complete interrupt is generated
       and the correspond call back is executed HAL_IRDA_TxCpltCallback() / HAL_IRDA_RxCpltCallback()
    */

    /* Stop IRDA DMA Tx request if ongoing */
    dmarequest = HAL_IS_BIT_SET(hirda->Instance->CR3, USART_CR3_DMAT);
    if ((hirda->gState == HAL_IRDA_STATE_BUSY_TX) && dmarequest)
    {
        CLEAR_BIT(hirda->Instance->CR3, USART_CR3_DMAT);

        /* Abort the IRDA DMA Tx channel */
        if (hirda->hdmatx != NULL)
        {
            HAL_DMA_Abort(hirda->hdmatx);
        }
        IRDA_EndTxTransfer(hirda);
    }

    /* Stop IRDA DMA Rx request if ongoing */
    dmarequest = HAL_IS_BIT_SET(hirda->Instance->CR3, USART_CR3_DMAR);
    if ((hirda->RxState == HAL_IRDA_STATE_BUSY_RX) && dmarequest)
    {
        CLEAR_BIT(hirda->Instance->CR3, USART_CR3_DMAR);

        /* Abort the IRDA DMA Rx channel */
        if (hirda->hdmarx != NULL)
        {
            HAL_DMA_Abort(hirda->hdmarx);
        }
        IRDA_EndRxTransfer(hirda);
    }

    return HAL_OK;
}

/**
  * @brief  Abort ongoing transfers (blocking mode).
  * @param  hirda IRDA handle.
  * @note   This procedure could be used for aborting any ongoing transfer started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable PPP Interrupts
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort (in case of transfer in DMA mode)
  *           - Set handle State to READY
  * @note   This procedure is executed in blocking mode : when exiting function, Abort is considered as completed.
  * @retval HAL status
*/
HAL_StatusTypeDef HAL_IRDA_Abort(IRDA_HandleTypeDef *hirda)
{
    /* Disable TXEIE, TCIE, RXNE, PE and ERR (Frame error, noise error, overrun error) interrupts */
    CLEAR_BIT(hirda->Instance->CR1, (USART_CR1_RXNEIE | USART_CR1_PEIE | USART_CR1_TXEIE | USART_CR1_TCIE));
    CLEAR_BIT(hirda->Instance->CR3, USART_CR3_EIE);

    /* Disable the IRDA DMA Tx request if enabled */
    if (HAL_IS_BIT_SET(hirda->Instance->CR3, USART_CR3_DMAT))
    {
        CLEAR_BIT(hirda->Instance->CR3, USART_CR3_DMAT);

        /* Abort the IRDA DMA Tx channel : use blocking DMA Abort API (no callback) */
        if (hirda->hdmatx != NULL)
        {
            /* Set the IRDA DMA Abort callback to Null.
               No call back execution at end of DMA abort procedure */
            hirda->hdmatx->XferAbortCallback = NULL;

            HAL_DMA_Abort(hirda->hdmatx);
        }
    }

    /* Disable the IRDA DMA Rx request if enabled */
    if (HAL_IS_BIT_SET(hirda->Instance->CR3, USART_CR3_DMAR))
    {
        CLEAR_BIT(hirda->Instance->CR3, USART_CR3_DMAR);

        /* Abort the IRDA DMA Rx channel : use blocking DMA Abort API (no callback) */
        if (hirda->hdmarx != NULL)
        {
            /* Set the IRDA DMA Abort callback to Null.
               No call back execution at end of DMA abort procedure */
            hirda->hdmarx->XferAbortCallback = NULL;

            HAL_DMA_Abort(hirda->hdmarx);
        }
    }

    /* Reset Tx and Rx transfer counters */
    hirda->TxXferCount = 0x00U;
    hirda->RxXferCount = 0x00U;

