sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_irda.c
    /* Reset ErrorCode */
    hirda->ErrorCode = HAL_IRDA_ERROR_NONE;

    /* Restore hirda->RxState and hirda->gState to Ready */
    hirda->RxState = HAL_IRDA_STATE_READY;
    hirda->gState = HAL_IRDA_STATE_READY;

    return HAL_OK;
}

/**
  * @brief  Abort ongoing Transmit transfer (blocking mode).
  * @param  hirda IRDA handle.
  * @note   This procedure could be used for aborting any ongoing transfer started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable PPP Interrupts
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort (in case of transfer in DMA mode)
  *           - Set handle State to READY
  * @note   This procedure is executed in blocking mode : when exiting function, Abort is considered as completed.
  * @retval HAL status
*/
HAL_StatusTypeDef HAL_IRDA_AbortTransmit(IRDA_HandleTypeDef *hirda)
{
    /* Disable TXEIE and TCIE interrupts */
    CLEAR_BIT(hirda->Instance->CR1, (USART_CR1_TXEIE | USART_CR1_TCIE));

    /* Disable the IRDA DMA Tx request if enabled */
    if (HAL_IS_BIT_SET(hirda->Instance->CR3, USART_CR3_DMAT))
    {
        CLEAR_BIT(hirda->Instance->CR3, USART_CR3_DMAT);

        /* Abort the IRDA DMA Tx channel : use blocking DMA Abort API (no callback) */
        if (hirda->hdmatx != NULL)
        {
            /* Set the IRDA DMA Abort callback to Null.
               No call back execution at end of DMA abort procedure */
            hirda->hdmatx->XferAbortCallback = NULL;

            HAL_DMA_Abort(hirda->hdmatx);
        }
    }

    /* Reset Tx transfer counter */
    hirda->TxXferCount = 0x00U;

    /* Restore hirda->gState to Ready */
    hirda->gState = HAL_IRDA_STATE_READY;

    return HAL_OK;
}

/**
  * @brief  Abort ongoing Receive transfer (blocking mode).
  * @param  hirda IRDA handle.
  * @note   This procedure could be used for aborting any ongoing transfer started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable PPP Interrupts
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort (in case of transfer in DMA mode)
  *           - Set handle State to READY
  * @note   This procedure is executed in blocking mode : when exiting function, Abort is considered as completed.
  * @retval HAL status
*/
HAL_StatusTypeDef HAL_IRDA_AbortReceive(IRDA_HandleTypeDef *hirda)
{
    /* Disable RXNE, PE and ERR (Frame error, noise error, overrun error) interrupts */
    CLEAR_BIT(hirda->Instance->CR1, (USART_CR1_RXNEIE | USART_CR1_PEIE));
    CLEAR_BIT(hirda->Instance->CR3, USART_CR3_EIE);

    /* Disable the IRDA DMA Rx request if enabled */
    if (HAL_IS_BIT_SET(hirda->Instance->CR3, USART_CR3_DMAR))
    {
        CLEAR_BIT(hirda->Instance->CR3, USART_CR3_DMAR);

        /* Abort the IRDA DMA Rx channel : use blocking DMA Abort API (no callback) */
        if (hirda->hdmarx != NULL)
        {
            /* Set the IRDA DMA Abort callback to Null.
               No call back execution at end of DMA abort procedure */
            hirda->hdmarx->XferAbortCallback = NULL;

            HAL_DMA_Abort(hirda->hdmarx);
        }
    }

    /* Reset Rx transfer counter */
    hirda->RxXferCount = 0x00U;

    /* Restore hirda->RxState to Ready */
    hirda->RxState = HAL_IRDA_STATE_READY;

    return HAL_OK;
}

/**
  * @brief  Abort ongoing transfers (Interrupt mode).
  * @param  hirda IRDA handle.
  * @note   This procedure could be used for aborting any ongoing transfer started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable PPP Interrupts
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort_IT (in case of transfer in DMA mode)
  *           - Set handle State to READY
  *           - At abort completion, call user abort complete callback
  * @note   This procedure is executed in Interrupt mode, meaning that abort procedure could be
  *         considered as completed only when user abort complete callback is executed (not when exiting function).
  * @retval HAL status
*/
HAL_StatusTypeDef HAL_IRDA_Abort_IT(IRDA_HandleTypeDef *hirda)
{
    uint32_t AbortCplt = 0x01U;

    /* Disable TXEIE, TCIE, RXNE, PE and ERR (Frame error, noise error, overrun error) interrupts */
    CLEAR_BIT(hirda->Instance->CR1, (USART_CR1_RXNEIE | USART_CR1_PEIE | USART_CR1_TXEIE | USART_CR1_TCIE));
    CLEAR_BIT(hirda->Instance->CR3, USART_CR3_EIE);

    /* If DMA Tx and/or DMA Rx Handles are associated to IRDA Handle, DMA Abort complete callbacks should be initialised
       before any call to DMA Abort functions */
    /* DMA Tx Handle is valid */
    if (hirda->hdmatx != NULL)
    {
        /* Set DMA Abort Complete callback if IRDA DMA Tx request if enabled.
           Otherwise, set it to NULL */
        if (HAL_IS_BIT_SET(hirda->Instance->CR3, USART_CR3_DMAT))
        {
            hirda->hdmatx->XferAbortCallback = IRDA_DMATxAbortCallback;
        }
        else
        {
            hirda->hdmatx->XferAbortCallback = NULL;
        }
    }
    /* DMA Rx Handle is valid */
    if (hirda->hdmarx != NULL)
    {
        /* Set DMA Abort Complete callback if IRDA DMA Rx request if enabled.
           Otherwise, set it to NULL */
        if (HAL_IS_BIT_SET(hirda->Instance->CR3, USART_CR3_DMAR))
        {
            hirda->hdmarx->XferAbortCallback = IRDA_DMARxAbortCallback;
        }
        else
        {
            hirda->hdmarx->XferAbortCallback = NULL;
        }
    }

    /* Disable the IRDA DMA Tx request if enabled */
    if (HAL_IS_BIT_SET(hirda->Instance->CR3, USART_CR3_DMAT))
    {
        /* Disable DMA Tx at IRDA level */
        CLEAR_BIT(hirda->Instance->CR3, USART_CR3_DMAT);

        /* Abort the IRDA DMA Tx channel : use non blocking DMA Abort API (callback) */
        if (hirda->hdmatx != NULL)
        {
            /* IRDA Tx DMA Abort callback has already been initialised :
               will lead to call HAL_IRDA_AbortCpltCallback() at end of DMA abort procedure */

