sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_irda.c
            /* Abort DMA TX */
            if (HAL_DMA_Abort_IT(hirda->hdmatx) != HAL_OK)
            {
                hirda->hdmatx->XferAbortCallback = NULL;
            }
            else
            {
                AbortCplt = 0x00U;
            }
        }
    }

    /* Disable the IRDA DMA Rx request if enabled */
    if (HAL_IS_BIT_SET(hirda->Instance->CR3, USART_CR3_DMAR))
    {
        CLEAR_BIT(hirda->Instance->CR3, USART_CR3_DMAR);

        /* Abort the IRDA DMA Rx channel : use non blocking DMA Abort API (callback) */
        if (hirda->hdmarx != NULL)
        {
            /* IRDA Rx DMA Abort callback has already been initialised :
               will lead to call HAL_IRDA_AbortCpltCallback() at end of DMA abort procedure */

            /* Abort DMA RX */
            if (HAL_DMA_Abort_IT(hirda->hdmarx) != HAL_OK)
            {
                hirda->hdmarx->XferAbortCallback = NULL;
                AbortCplt = 0x01U;
            }
            else
            {
                AbortCplt = 0x00U;
            }
        }
    }

    /* if no DMA abort complete callback execution is required => call user Abort Complete callback */
    if (AbortCplt == 0x01U)
    {
        /* Reset Tx and Rx transfer counters */
        hirda->TxXferCount = 0x00U;
        hirda->RxXferCount = 0x00U;

        /* Reset ErrorCode */
        hirda->ErrorCode = HAL_IRDA_ERROR_NONE;

        /* Restore hirda->gState and hirda->RxState to Ready */
        hirda->gState  = HAL_IRDA_STATE_READY;
        hirda->RxState = HAL_IRDA_STATE_READY;

        /* As no DMA to be aborted, call directly user Abort complete callback */
#if (USE_HAL_IRDA_REGISTER_CALLBACKS == 1)
        /* Call registered Abort complete callback */
        hirda->AbortCpltCallback(hirda);
#else
        /* Call legacy weak Abort complete callback */
        HAL_IRDA_AbortCpltCallback(hirda);
#endif /* USE_HAL_IRDA_REGISTER_CALLBACK */
    }

    return HAL_OK;
}

/**
  * @brief  Abort ongoing Transmit transfer (Interrupt mode).
  * @param  hirda IRDA handle.
  * @note   This procedure could be used for aborting any ongoing transfer started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable IRDA Interrupts (Tx)
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort_IT (in case of transfer in DMA mode)
  *           - Set handle State to READY
  *           - At abort completion, call user abort complete callback
  * @note   This procedure is executed in Interrupt mode, meaning that abort procedure could be
  *         considered as completed only when user abort complete callback is executed (not when exiting function).
  * @retval HAL status
*/
HAL_StatusTypeDef HAL_IRDA_AbortTransmit_IT(IRDA_HandleTypeDef *hirda)
{
    /* Disable TXEIE and TCIE interrupts */
    CLEAR_BIT(hirda->Instance->CR1, (USART_CR1_TXEIE | USART_CR1_TCIE));

    /* Disable the IRDA DMA Tx request if enabled */
    if (HAL_IS_BIT_SET(hirda->Instance->CR3, USART_CR3_DMAT))
    {
        CLEAR_BIT(hirda->Instance->CR3, USART_CR3_DMAT);

        /* Abort the IRDA DMA Tx channel : use non blocking DMA Abort API (callback) */
        if (hirda->hdmatx != NULL)
        {
            /* Set the IRDA DMA Abort callback :
               will lead to call HAL_IRDA_AbortCpltCallback() at end of DMA abort procedure */
            hirda->hdmatx->XferAbortCallback = IRDA_DMATxOnlyAbortCallback;

            /* Abort DMA TX */
            if (HAL_DMA_Abort_IT(hirda->hdmatx) != HAL_OK)
            {
                /* Call Directly hirda->hdmatx->XferAbortCallback function in case of error */
                hirda->hdmatx->XferAbortCallback(hirda->hdmatx);
            }
        }
        else
        {
            /* Reset Tx transfer counter */
            hirda->TxXferCount = 0x00U;

            /* Restore hirda->gState to Ready */
            hirda->gState = HAL_IRDA_STATE_READY;

            /* As no DMA to be aborted, call directly user Abort complete callback */
#if (USE_HAL_IRDA_REGISTER_CALLBACKS == 1)
            /* Call registered Abort Transmit Complete Callback */
            hirda->AbortTransmitCpltCallback(hirda);
#else
            /* Call legacy weak Abort Transmit Complete Callback */
            HAL_IRDA_AbortTransmitCpltCallback(hirda);
#endif /* USE_HAL_IRDA_REGISTER_CALLBACK */
        }
    }
    else
    {
        /* Reset Tx transfer counter */
        hirda->TxXferCount = 0x00U;

        /* Restore hirda->gState to Ready */
        hirda->gState = HAL_IRDA_STATE_READY;

        /* As no DMA to be aborted, call directly user Abort complete callback */
#if (USE_HAL_IRDA_REGISTER_CALLBACKS == 1)
        /* Call registered Abort Transmit Complete Callback */
        hirda->AbortTransmitCpltCallback(hirda);
#else
        /* Call legacy weak Abort Transmit Complete Callback */
        HAL_IRDA_AbortTransmitCpltCallback(hirda);
#endif /* USE_HAL_IRDA_REGISTER_CALLBACK */
    }

    return HAL_OK;
}

/**
  * @brief  Abort ongoing Receive transfer (Interrupt mode).
  * @param  hirda IRDA handle.
  * @note   This procedure could be used for aborting any ongoing transfer started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable PPP Interrupts
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort_IT (in case of transfer in DMA mode)
  *           - Set handle State to READY
  *           - At abort completion, call user abort complete callback
  * @note   This procedure is executed in Interrupt mode, meaning that abort procedure could be
  *         considered as completed only when user abort complete callback is executed (not when exiting function).
  * @retval HAL status
*/
HAL_StatusTypeDef HAL_IRDA_AbortReceive_IT(IRDA_HandleTypeDef *hirda)
{
    /* Disable RXNE, PE and ERR (Frame error, noise error, overrun error) interrupts */
    CLEAR_BIT(hirda->Instance->CR1, (USART_CR1_RXNEIE | USART_CR1_PEIE));
    CLEAR_BIT(hirda->Instance->CR3, USART_CR3_EIE);

    /* Disable the IRDA DMA Rx request if enabled */
    if (HAL_IS_BIT_SET(hirda->Instance->CR3, USART_CR3_DMAR))
    {
        CLEAR_BIT(hirda->Instance->CR3, USART_CR3_DMAR);

        /* Abort the IRDA DMA Rx channel : use non blocking DMA Abort API (callback) */
        if (hirda->hdmarx != NULL)
        {
            /* Set the IRDA DMA Abort callback :
               will lead to call HAL_IRDA_AbortCpltCallback() at end of DMA abort procedure */
            hirda->hdmarx->XferAbortCallback = IRDA_DMARxOnlyAbortCallback;

