sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_irda.c
            /* Abort DMA RX */
            if (HAL_DMA_Abort_IT(hirda->hdmarx) != HAL_OK)
            {
                /* Call Directly hirda->hdmarx->XferAbortCallback function in case of error */
                hirda->hdmarx->XferAbortCallback(hirda->hdmarx);
            }
        }
        else
        {
            /* Reset Rx transfer counter */
            hirda->RxXferCount = 0x00U;

            /* Restore hirda->RxState to Ready */
            hirda->RxState = HAL_IRDA_STATE_READY;

            /* As no DMA to be aborted, call directly user Abort complete callback */
#if (USE_HAL_IRDA_REGISTER_CALLBACKS == 1)
            /* Call registered Abort Receive Complete Callback */
            hirda->AbortReceiveCpltCallback(hirda);
#else
            /* Call legacy weak Abort Receive Complete Callback */
            HAL_IRDA_AbortReceiveCpltCallback(hirda);
#endif /* USE_HAL_IRDA_REGISTER_CALLBACK */
        }
    }
    else
    {
        /* Reset Rx transfer counter */
        hirda->RxXferCount = 0x00U;

        /* Restore hirda->RxState to Ready */
        hirda->RxState = HAL_IRDA_STATE_READY;

        /* As no DMA to be aborted, call directly user Abort complete callback */
#if (USE_HAL_IRDA_REGISTER_CALLBACKS == 1)
        /* Call registered Abort Receive Complete Callback */
        hirda->AbortReceiveCpltCallback(hirda);
#else
        /* Call legacy weak Abort Receive Complete Callback */
        HAL_IRDA_AbortReceiveCpltCallback(hirda);
#endif /* USE_HAL_IRDA_REGISTER_CALLBACK */
    }

    return HAL_OK;
}

/**
  * @brief  This function handles IRDA interrupt request.
  * @param  hirda  Pointer to a IRDA_HandleTypeDef structure that contains
  *                the configuration information for the specified IRDA module.
  * @retval None
  */
void HAL_IRDA_IRQHandler(IRDA_HandleTypeDef *hirda)
{
    uint32_t isrflags   = READ_REG(hirda->Instance->SR);
    uint32_t cr1its     = READ_REG(hirda->Instance->CR1);
    uint32_t cr3its     = READ_REG(hirda->Instance->CR3);
    uint32_t errorflags = 0x00U;
    uint32_t dmarequest = 0x00U;

    /* If no error occurs */
    errorflags = (isrflags & (uint32_t)(USART_SR_PE | USART_SR_FE | USART_SR_ORE | USART_SR_NE));
    if (errorflags == RESET)
    {
        /* IRDA in mode Receiver -----------------------------------------------*/
        if (((isrflags & USART_SR_RXNE) != RESET) && ((cr1its & USART_CR1_RXNEIE) != RESET))
        {
            IRDA_Receive_IT(hirda);
            return;
        }
    }

    /* If some errors occur */
    if ((errorflags != RESET) && (((cr3its & USART_CR3_EIE) != RESET) || ((cr1its & (USART_CR1_RXNEIE | USART_CR1_PEIE)) != RESET)))
    {
        /* IRDA parity error interrupt occurred -------------------------------*/
        if (((isrflags & USART_SR_PE) != RESET) && ((cr1its & USART_CR1_PEIE) != RESET))
        {
            hirda->ErrorCode |= HAL_IRDA_ERROR_PE;
        }

        /* IRDA noise error interrupt occurred --------------------------------*/
        if (((isrflags & USART_SR_NE) != RESET) && ((cr3its & USART_CR3_EIE) != RESET))
        {
            hirda->ErrorCode |= HAL_IRDA_ERROR_NE;
        }

        /* IRDA frame error interrupt occurred --------------------------------*/
        if (((isrflags & USART_SR_FE) != RESET) && ((cr3its & USART_CR3_EIE) != RESET))
        {
            hirda->ErrorCode |= HAL_IRDA_ERROR_FE;
        }

        /* IRDA Over-Run interrupt occurred -----------------------------------*/
        if (((isrflags & USART_SR_ORE) != RESET) && ((cr3its & USART_CR3_EIE) != RESET))
        {
            hirda->ErrorCode |= HAL_IRDA_ERROR_ORE;
        }
        /* Call IRDA Error Call back function if need be -----------------------*/
        if (hirda->ErrorCode != HAL_IRDA_ERROR_NONE)
        {
            /* IRDA in mode Receiver ---------------------------------------------*/
            if (((isrflags & USART_SR_RXNE) != RESET) && ((cr1its & USART_CR1_RXNEIE) != RESET))
            {
                IRDA_Receive_IT(hirda);
            }

            /* If Overrun error occurs, or if any error occurs in DMA mode reception,
               consider error as blocking */
            dmarequest = HAL_IS_BIT_SET(hirda->Instance->CR3, USART_CR3_DMAR);
            if (((hirda->ErrorCode & HAL_IRDA_ERROR_ORE) != RESET) || dmarequest)
            {
                /* Blocking error : transfer is aborted
                   Set the IRDA state ready to be able to start again the process,
                   Disable Rx Interrupts, and disable Rx DMA request, if ongoing */
                IRDA_EndRxTransfer(hirda);

                /* Disable the IRDA DMA Rx request if enabled */
                if (HAL_IS_BIT_SET(hirda->Instance->CR3, USART_CR3_DMAR))
                {
                    CLEAR_BIT(hirda->Instance->CR3, USART_CR3_DMAR);

                    /* Abort the IRDA DMA Rx channel */
                    if (hirda->hdmarx != NULL)
                    {
                        /* Set the IRDA DMA Abort callback :
                        will lead to call HAL_IRDA_ErrorCallback() at end of DMA abort procedure */
                        hirda->hdmarx->XferAbortCallback = IRDA_DMAAbortOnError;

                        /* Abort DMA RX */
                        if (HAL_DMA_Abort_IT(hirda->hdmarx) != HAL_OK)
                        {
                            /* Call Directly XferAbortCallback function in case of error */
                            hirda->hdmarx->XferAbortCallback(hirda->hdmarx);
                        }
                    }
                    else
                    {
#if (USE_HAL_IRDA_REGISTER_CALLBACKS == 1)
                        /* Call registered user error callback */
                        hirda->ErrorCallback(hirda);
#else
                        /* Call legacy weak user error callback */
                        HAL_IRDA_ErrorCallback(hirda);
#endif /* USE_HAL_IRDA_REGISTER_CALLBACK */
                    }
                }
                else
                {
#if (USE_HAL_IRDA_REGISTER_CALLBACKS == 1)
                    /* Call registered user error callback */
                    hirda->ErrorCallback(hirda);
#else
                    /* Call legacy weak user error callback */
                    HAL_IRDA_ErrorCallback(hirda);
#endif /* USE_HAL_IRDA_REGISTER_CALLBACK */
                }
            }
            else
            {
                /* Non Blocking error : transfer could go on.
                   Error is notified to user through user error callback */
#if (USE_HAL_IRDA_REGISTER_CALLBACKS == 1)
                /* Call registered user error callback */
                hirda->ErrorCallback(hirda);
#else
                /* Call legacy weak user error callback */
                HAL_IRDA_ErrorCallback(hirda);
#endif /* USE_HAL_IRDA_REGISTER_CALLBACK */

                hirda->ErrorCode = HAL_IRDA_ERROR_NONE;
            }
        }
        return;
    } /* End if some error occurs */

    /* IRDA in mode Transmitter ------------------------------------------------*/
    if (((isrflags & USART_SR_TXE) != RESET) && ((cr1its & USART_CR1_TXEIE) != RESET))
    {
        IRDA_Transmit_IT(hirda);
        return;
    }

    /* IRDA in mode Transmitter end --------------------------------------------*/
    if (((isrflags & USART_SR_TC) != RESET) && ((cr1its & USART_CR1_TCIE) != RESET))
    {
        IRDA_EndTransmit_IT(hirda);
        return;
    }
}

/**
  * @brief  Tx Transfer complete callback.
  * @param  hirda  Pointer to a IRDA_HandleTypeDef structure that contains
  *                the configuration information for the specified IRDA module.
  * @retval None
  */
__weak void HAL_IRDA_TxCpltCallback(IRDA_HandleTypeDef *hirda)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hirda);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_IRDA_TxCpltCallback can be implemented in the user file.
     */
}

/**
  * @brief  Tx Half Transfer completed callback.
  * @param  hirda  Pointer to a IRDA_HandleTypeDef structure that contains
  *                the configuration information for the specified USART module.
  * @retval None
  */
__weak void HAL_IRDA_TxHalfCpltCallback(IRDA_HandleTypeDef *hirda)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hirda);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_IRDA_TxHalfCpltCallback can be implemented in the user file.
     */
}

/**
  * @brief  Rx Transfer complete callback.
  * @param  hirda  Pointer to a IRDA_HandleTypeDef structure that contains
  *                the configuration information for the specified IRDA module.
  * @retval None
  */
__weak void HAL_IRDA_RxCpltCallback(IRDA_HandleTypeDef *hirda)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hirda);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_IRDA_RxCpltCallback can be implemented in the user file.
     */
}

/**
  * @brief  Rx Half Transfer complete callback.
  * @param  hirda  Pointer to a IRDA_HandleTypeDef structure that contains
  *                the configuration information for the specified IRDA module.
  * @retval None
  */
__weak void HAL_IRDA_RxHalfCpltCallback(IRDA_HandleTypeDef *hirda)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hirda);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_IRDA_RxHalfCpltCallback can be implemented in the user file.
     */
}

/**
  * @brief  IRDA error callback.
  * @param  hirda  Pointer to a IRDA_HandleTypeDef structure that contains
  *                the configuration information for the specified IRDA module.
  * @retval None
  */
__weak void HAL_IRDA_ErrorCallback(IRDA_HandleTypeDef *hirda)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hirda);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_IRDA_ErrorCallback can be implemented in the user file.
     */
}

/**
  * @brief  IRDA Abort Complete callback.
  * @param  hirda Pointer to a IRDA_HandleTypeDef structure that contains
  *                the configuration information for the specified IRDA module.
  * @retval None
  */
__weak void HAL_IRDA_AbortCpltCallback(IRDA_HandleTypeDef *hirda)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hirda);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_IRDA_AbortCpltCallback can be implemented in the user file.
     */
}

/**
  * @brief  IRDA Abort Transmit Complete callback.
  * @param  hirda Pointer to a IRDA_HandleTypeDef structure that contains
  *                the configuration information for the specified IRDA module.
  * @retval None
  */
__weak void HAL_IRDA_AbortTransmitCpltCallback(IRDA_HandleTypeDef *hirda)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hirda);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_IRDA_AbortTransmitCpltCallback can be implemented in the user file.
     */
}

/**
  * @brief  IRDA Abort Receive Complete callback.
  * @param  hirda Pointer to a IRDA_HandleTypeDef structure that contains
  *                the configuration information for the specified IRDA module.
  * @retval None
  */
__weak void HAL_IRDA_AbortReceiveCpltCallback(IRDA_HandleTypeDef *hirda)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hirda);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_IRDA_AbortReceiveCpltCallback can be implemented in the user file.
     */
}

/**
  * @}
  */

/** @defgroup IRDA_Exported_Functions_Group3 Peripheral State and Errors functions
  *  @brief   IRDA State and Errors functions
  *
@verbatim
  ==============================================================================
                  ##### Peripheral State and Errors functions #####
  ==============================================================================
  [..]
    This subsection provides a set of functions allowing to return the State of IrDA
    communication process and also return Peripheral Errors occurred during communication process
     (+) HAL_IRDA_GetState() API can be helpful to check in run-time the state of the IrDA peripheral.
     (+) HAL_IRDA_GetError() check in run-time errors that could be occurred during communication.

@endverbatim
  * @{
  */

/**
  * @brief  Return the IRDA state.
  * @param  hirda  Pointer to a IRDA_HandleTypeDef structure that contains
  *                the configuration information for the specified IRDA.
  * @retval HAL state
  */
HAL_IRDA_StateTypeDef HAL_IRDA_GetState(IRDA_HandleTypeDef *hirda)
{
    uint32_t temp1 = 0x00U, temp2 = 0x00U;
    temp1 = hirda->gState;
    temp2 = hirda->RxState;

    return (HAL_IRDA_StateTypeDef)(temp1 | temp2);
}

/**
  * @brief  Return the IRDA error code
  * @param  hirda  Pointer to a IRDA_HandleTypeDef structure that contains
  *              the configuration information for the specified IRDA.
  * @retval IRDA Error Code
  */
uint32_t HAL_IRDA_GetError(IRDA_HandleTypeDef *hirda)
{
    return hirda->ErrorCode;
}

/**
  * @}
  */

/**
  * @}
  */

