sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_irda.c
/** @defgroup IRDA_Private_Functions IRDA Private Functions
  * @{
  */

#if (USE_HAL_IRDA_REGISTER_CALLBACKS == 1)
/**
  * @brief  Initialize the callbacks to their default values.
  * @param  hirda IRDA handle.
  * @retval none
  */
void IRDA_InitCallbacksToDefault(IRDA_HandleTypeDef *hirda)
{
    /* Init the IRDA Callback settings */
    hirda->TxHalfCpltCallback        = HAL_IRDA_TxHalfCpltCallback;        /* Legacy weak TxHalfCpltCallback        */
    hirda->TxCpltCallback            = HAL_IRDA_TxCpltCallback;            /* Legacy weak TxCpltCallback            */
    hirda->RxHalfCpltCallback        = HAL_IRDA_RxHalfCpltCallback;        /* Legacy weak RxHalfCpltCallback        */
    hirda->RxCpltCallback            = HAL_IRDA_RxCpltCallback;            /* Legacy weak RxCpltCallback            */
    hirda->ErrorCallback             = HAL_IRDA_ErrorCallback;             /* Legacy weak ErrorCallback             */
    hirda->AbortCpltCallback         = HAL_IRDA_AbortCpltCallback;         /* Legacy weak AbortCpltCallback         */
    hirda->AbortTransmitCpltCallback = HAL_IRDA_AbortTransmitCpltCallback; /* Legacy weak AbortTransmitCpltCallback */
    hirda->AbortReceiveCpltCallback  = HAL_IRDA_AbortReceiveCpltCallback;  /* Legacy weak AbortReceiveCpltCallback  */

}
#endif /* USE_HAL_IRDA_REGISTER_CALLBACKS */

/**
  * @brief  DMA IRDA transmit process complete callback.
  * @param  hdma  Pointer to a DMA_HandleTypeDef structure that contains
  *               the configuration information for the specified DMA.
  * @retval None
  */
static void IRDA_DMATransmitCplt(DMA_HandleTypeDef *hdma)
{
    IRDA_HandleTypeDef *hirda = (IRDA_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;
    /* DMA Normal mode */
    if ((hdma->Instance->CCR & DMA_CCR_CIRC) == 0U)
    {
        hirda->TxXferCount = 0U;

        /* Disable the DMA transfer for transmit request by resetting the DMAT bit
           in the IRDA CR3 register */
        CLEAR_BIT(hirda->Instance->CR3, USART_CR3_DMAT);

        /* Enable the IRDA Transmit Complete Interrupt */
        SET_BIT(hirda->Instance->CR1, USART_CR1_TCIE);
    }
    /* DMA Circular mode */
    else
    {
#if (USE_HAL_IRDA_REGISTER_CALLBACKS == 1)
        /* Call registered Tx complete callback */
        hirda->TxCpltCallback(hirda);
#else
        /* Call legacy weak Tx complete callback */
        HAL_IRDA_TxCpltCallback(hirda);
#endif /* USE_HAL_IRDA_REGISTER_CALLBACK */
    }
}

/**
  * @brief DMA IRDA receive process half complete callback
  * @param  hdma  Pointer to a DMA_HandleTypeDef structure that contains
  *               the configuration information for the specified DMA.
  * @retval None
  */
static void IRDA_DMATransmitHalfCplt(DMA_HandleTypeDef *hdma)
{
    IRDA_HandleTypeDef *hirda = (IRDA_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

#if (USE_HAL_IRDA_REGISTER_CALLBACKS == 1)
    /* Call registered Tx Half complete callback */
    hirda->TxHalfCpltCallback(hirda);
#else
    /* Call legacy weak Tx complete callback */
    HAL_IRDA_TxHalfCpltCallback(hirda);
#endif /* USE_HAL_IRDA_REGISTER_CALLBACK */
}

/**
  * @brief  DMA IRDA receive process complete callback.
  * @param  hdma  Pointer to a DMA_HandleTypeDef structure that contains
  *               the configuration information for the specified DMA.
  * @retval None
  */
static void IRDA_DMAReceiveCplt(DMA_HandleTypeDef *hdma)
{
    IRDA_HandleTypeDef *hirda = (IRDA_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

    /* DMA Normal mode */
    if ((hdma->Instance->CCR & DMA_CCR_CIRC) == 0U)
    {
        hirda->RxXferCount = 0U;

        /* Disable PE and ERR (Frame error, noise error, overrun error) interrupts */
        CLEAR_BIT(hirda->Instance->CR1, USART_CR1_PEIE);
        CLEAR_BIT(hirda->Instance->CR3, USART_CR3_EIE);

        /* Disable the DMA transfer for the receiver request by resetting the DMAR bit
           in the IRDA CR3 register */
        CLEAR_BIT(hirda->Instance->CR3, USART_CR3_DMAR);

        /* At end of Rx process, restore hirda->RxState to Ready */
        hirda->RxState = HAL_IRDA_STATE_READY;
    }

#if (USE_HAL_IRDA_REGISTER_CALLBACKS == 1)
    /* Call registered Rx complete callback */
    hirda->RxCpltCallback(hirda);
#else
    /* Call legacy weak Rx complete callback */
    HAL_IRDA_RxCpltCallback(hirda);
#endif /* USE_HAL_IRDA_REGISTER_CALLBACKS */
}

/**
  * @brief DMA IRDA receive process half complete callback.
  * @param  hdma  Pointer to a DMA_HandleTypeDef structure that contains
  *               the configuration information for the specified DMA.
  * @retval None
  */
static void IRDA_DMAReceiveHalfCplt(DMA_HandleTypeDef *hdma)
{
    IRDA_HandleTypeDef *hirda = (IRDA_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

#if (USE_HAL_IRDA_REGISTER_CALLBACKS == 1)
    /*Call registered Rx Half complete callback*/
    hirda->RxHalfCpltCallback(hirda);
#else
    /* Call legacy weak Rx Half complete callback */
    HAL_IRDA_RxHalfCpltCallback(hirda);
#endif /* USE_HAL_IRDA_REGISTER_CALLBACK */
}

/**
  * @brief  DMA IRDA communication error callback.
  * @param  hdma  Pointer to a DMA_HandleTypeDef structure that contains
  *               the configuration information for the specified DMA.
  * @retval None
  */
static void IRDA_DMAError(DMA_HandleTypeDef *hdma)
{
    uint32_t dmarequest = 0x00U;
    IRDA_HandleTypeDef *hirda = (IRDA_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

    /* Stop IRDA DMA Tx request if ongoing */
    dmarequest = HAL_IS_BIT_SET(hirda->Instance->CR3, USART_CR3_DMAT);
    if ((hirda->gState == HAL_IRDA_STATE_BUSY_TX) && dmarequest)
    {
        hirda->TxXferCount = 0U;
        IRDA_EndTxTransfer(hirda);
    }

    /* Stop IRDA DMA Rx request if ongoing */
    dmarequest = HAL_IS_BIT_SET(hirda->Instance->CR3, USART_CR3_DMAR);
    if ((hirda->RxState == HAL_IRDA_STATE_BUSY_RX) && dmarequest)
    {
        hirda->RxXferCount = 0U;
        IRDA_EndRxTransfer(hirda);
    }

    hirda->ErrorCode |= HAL_IRDA_ERROR_DMA;

#if (USE_HAL_IRDA_REGISTER_CALLBACKS == 1)
    /* Call registered user error callback */
    hirda->ErrorCallback(hirda);
#else
    /* Call legacy weak user error callback */
    HAL_IRDA_ErrorCallback(hirda);
#endif /* USE_HAL_IRDA_REGISTER_CALLBACK */
}

/**
  * @brief  This function handles IRDA Communication Timeout.
  * @param  hirda  Pointer to a IRDA_HandleTypeDef structure that contains
  *                the configuration information for the specified IRDA.
  * @param  Flag specifies the IRDA flag to check.
  * @param  Status The new Flag status (SET or RESET).
  * @param  Tickstart Tick start value
  * @param  Timeout Timeout duration
  * @retval HAL status
  */
static HAL_StatusTypeDef IRDA_WaitOnFlagUntilTimeout(IRDA_HandleTypeDef *hirda, uint32_t Flag, FlagStatus Status, uint32_t Tickstart, uint32_t Timeout)
{
    /* Wait until flag is set */
    while ((__HAL_IRDA_GET_FLAG(hirda, Flag) ? SET : RESET) == Status)
    {
        /* Check for the Timeout */
        if (Timeout != HAL_MAX_DELAY)
        {
            if ((Timeout == 0U) || ((HAL_GetTick() - Tickstart) > Timeout))
            {
                /* Disable TXE, RXNE, PE and ERR (Frame error, noise error, overrun error) interrupts for the interrupt process */
                CLEAR_BIT(hirda->Instance->CR1, (USART_CR1_RXNEIE | USART_CR1_PEIE | USART_CR1_TXEIE));
                CLEAR_BIT(hirda->Instance->CR3, USART_CR3_EIE);

                hirda->gState  = HAL_IRDA_STATE_READY;
                hirda->RxState = HAL_IRDA_STATE_READY;

                /* Process Unlocked */
                __HAL_UNLOCK(hirda);

