sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_irda.c
    /* Check that a Tx process is ongoing */
    if (hirda->gState == HAL_IRDA_STATE_BUSY_TX)
    {
        if (hirda->Init.WordLength == IRDA_WORDLENGTH_9B)
        {
            tmp = (uint16_t *) hirda->pTxBuffPtr;
            hirda->Instance->DR = (uint16_t)(*tmp & (uint16_t)0x01FF);
            if (hirda->Init.Parity == IRDA_PARITY_NONE)
            {
                hirda->pTxBuffPtr += 2U;
            }
            else
            {
                hirda->pTxBuffPtr += 1U;
            }
        }
        else
        {
            hirda->Instance->DR = (uint8_t)(*hirda->pTxBuffPtr++ & (uint8_t)0x00FF);
        }

        if (--hirda->TxXferCount == 0U)
        {
            /* Disable the IRDA Transmit Data Register Empty Interrupt */
            CLEAR_BIT(hirda->Instance->CR1, USART_CR1_TXEIE);

            /* Enable the IRDA Transmit Complete Interrupt */
            SET_BIT(hirda->Instance->CR1, USART_CR1_TCIE);
        }

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief  Wraps up transmission in non blocking mode.
  * @param  hirda  Pointer to a IRDA_HandleTypeDef structure that contains
  *                the configuration information for the specified IRDA module.
  * @retval HAL status
  */
static HAL_StatusTypeDef IRDA_EndTransmit_IT(IRDA_HandleTypeDef *hirda)
{
    /* Disable the IRDA Transmit Complete Interrupt */
    CLEAR_BIT(hirda->Instance->CR1, USART_CR1_TCIE);

    /* Disable the IRDA Error Interrupt: (Frame error, noise error, overrun error) */
    CLEAR_BIT(hirda->Instance->CR3, USART_CR3_EIE);

    /* Tx process is ended, restore hirda->gState to Ready */
    hirda->gState = HAL_IRDA_STATE_READY;

#if (USE_HAL_IRDA_REGISTER_CALLBACKS == 1)
    /* Call registered Tx complete callback */
    hirda->TxCpltCallback(hirda);
#else
    /* Call legacy weak Tx complete callback */
    HAL_IRDA_TxCpltCallback(hirda);
#endif /* USE_HAL_IRDA_REGISTER_CALLBACK */

    return HAL_OK;
}

/**
  * @brief  Receives an amount of data in non blocking mode.
  * @param  hirda  Pointer to a IRDA_HandleTypeDef structure that contains
  *                the configuration information for the specified IRDA module.
  * @retval HAL status
  */
static HAL_StatusTypeDef IRDA_Receive_IT(IRDA_HandleTypeDef *hirda)
{
    uint16_t *tmp;
    uint16_t  uhdata;

    /* Check that a Rx process is ongoing */
    if (hirda->RxState == HAL_IRDA_STATE_BUSY_RX)
    {
        uhdata = (uint16_t) READ_REG(hirda->Instance->DR);
        if (hirda->Init.WordLength == IRDA_WORDLENGTH_9B)
        {
            tmp = (uint16_t *) hirda->pRxBuffPtr;
            if (hirda->Init.Parity == IRDA_PARITY_NONE)
            {
                *tmp = (uint16_t)(uhdata & (uint16_t)0x01FF);
                hirda->pRxBuffPtr += 2U;
            }
            else
            {
                *tmp = (uint16_t)(uhdata & (uint16_t)0x00FF);
                hirda->pRxBuffPtr += 1U;
            }
        }
        else
        {
            if (hirda->Init.Parity == IRDA_PARITY_NONE)
            {
                *hirda->pRxBuffPtr++ = (uint8_t)(uhdata & (uint8_t)0x00FF);
            }
            else
            {
                *hirda->pRxBuffPtr++ = (uint8_t)(uhdata & (uint8_t)0x007F);
            }
        }

        if (--hirda->RxXferCount == 0U)
        {
            /* Disable the IRDA Data Register not empty Interrupt */
            CLEAR_BIT(hirda->Instance->CR1, USART_CR1_RXNEIE);

            /* Disable the IRDA Parity Error Interrupt */
            CLEAR_BIT(hirda->Instance->CR1, USART_CR1_PEIE);

            /* Disable the IRDA Error Interrupt: (Frame error, noise error, overrun error) */
            CLEAR_BIT(hirda->Instance->CR3, USART_CR3_EIE);

            /* Rx process is completed, restore hirda->RxState to Ready */
            hirda->RxState = HAL_IRDA_STATE_READY;

#if (USE_HAL_IRDA_REGISTER_CALLBACKS == 1)
            /* Call registered Rx complete callback */
            hirda->RxCpltCallback(hirda);
#else
            /* Call legacy weak Rx complete callback */
            HAL_IRDA_RxCpltCallback(hirda);
#endif /* USE_HAL_IRDA_REGISTER_CALLBACKS */

            return HAL_OK;
        }
        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief  Configures the IRDA peripheral.
  * @param  hirda  Pointer to a IRDA_HandleTypeDef structure that contains
  *                the configuration information for the specified IRDA module.
  * @retval None
  */
static void IRDA_SetConfig(IRDA_HandleTypeDef *hirda)
{
    uint32_t pclk;

    /* Check the parameters */
    assert_param(IS_IRDA_INSTANCE(hirda->Instance));
    assert_param(IS_IRDA_BAUDRATE(hirda->Init.BaudRate));
    assert_param(IS_IRDA_WORD_LENGTH(hirda->Init.WordLength));
    assert_param(IS_IRDA_PARITY(hirda->Init.Parity));
    assert_param(IS_IRDA_MODE(hirda->Init.Mode));
    assert_param(IS_IRDA_POWERMODE(hirda->Init.IrDAMode));

    /*-------------------------- USART CR2 Configuration ------------------------*/
    /* Clear STOP[13:12] bits */
    CLEAR_BIT(hirda->Instance->CR2, USART_CR2_STOP);

    /*-------------------------- USART CR1 Configuration -----------------------*/
    /* Clear M, PCE, PS, TE and RE bits */
    CLEAR_BIT(hirda->Instance->CR1, (USART_CR1_M | USART_CR1_PCE | USART_CR1_PS | USART_CR1_TE | USART_CR1_RE));

    /* Configure the USART Word Length, Parity and mode:
       Set the M bits according to hirda->Init.WordLength value
       Set PCE and PS bits according to hirda->Init.Parity value
       Set TE and RE bits according to hirda->Init.Mode value */
    /* Write to USART CR1 */
    SET_BIT(hirda->Instance->CR1, (hirda->Init.WordLength | hirda->Init.Parity | hirda->Init.Mode));

    /*-------------------------- USART CR3 Configuration -----------------------*/
    /* Clear CTSE and RTSE bits */
    CLEAR_BIT(hirda->Instance->CR3, (USART_CR3_RTSE | USART_CR3_CTSE));

    /*-------------------------- USART BRR Configuration -----------------------*/
    if(hirda->Instance == USART1)
    {
        pclk = HAL_RCC_GetPCLK2Freq();
        SET_BIT(hirda->Instance->BRR, IRDA_BRR(pclk, hirda->Init.BaudRate));
    }
    else
    {
        pclk = HAL_RCC_GetPCLK1Freq();
        SET_BIT(hirda->Instance->BRR, IRDA_BRR(pclk, hirda->Init.BaudRate));
    }
}

/**
  * @}
  */

#endif /* HAL_IRDA_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT Puya Semiconductor *****END OF FILE****/
